//
// Created by xiexu on 2022/10/14.
//

// 1
// 0
// 1

// 2
// 00
// 11
// 10

// 3
// 000
// 111
// 101
// 100

// 4
// 0000
// 1111
// 1010
// 1000
// 1001

// 5
// 00000
// 11111
// 10101
// 10001
// 10011
// 10010

// 6
// 000000
// 111111
// 101010
// 100011
// 100111
// 100101
// 100100
//  对每个数，打印1与%n==0（1到数）个数为偶的那些数

#include <stdio.h>

int main(void)
{
	int input = 0;
	scanf("%d", &input);

	for (int i = 1; i <= input; i++)
	{
		int times = 0;
		for (int j = 1; j <= i; j++)
		{
			if (i % j == 0)
			{
				times++;
			}
		}

		if (times % 2 == 1)
		{
			printf("%d ",i);
		}
	}

	return 0;
}

